In [2]:
%matplotlib inline

In [3]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import os

In [4]:
# Loading in our csv files
city_data_to_load = "Resources/city_data.csv"
ride_data_to_load = "Resources/ride_data.csv"

In [5]:
city_data_df = pd.read_csv(city_data_to_load)
city_data_df

                city  driver_count   type
0        Richardfort            38  Urban
1       Williamsstad            59  Urban
2        Port Angela            67  Urban
3         Rodneyfort            34  Urban
4        West Robert            39  Urban
..               ...           ...    ...
115     Bradshawfurt             7  Rural
116     New Ryantown             2  Rural
117   Randallchester             9  Rural
118      Jessicaport             1  Rural
119  South Saramouth             7  Rural

[120 rows x 3 columns]

In [6]:
ride_data_df = pd.read_csv(ride_data_to_load)
ride_data_df.head(10)

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344
5        South Latoya  2019-03-11 12:26:48   9.52  1994999424437
6       New Paulville  2019-02-27 11:17:56  43.25   793208410091
7        Simpsonburgh  2019-04-26 00:43:24  35.98   111953927754
8     South Karenland  2019-01-08 03:28:48  35.09  7995623208694
9       North Jasmine  2019-03-09 06:26:29  42.81  5327642267789

In [7]:
#Check both data frames for null values
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [8]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [9]:
# Get data types from both data frames
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [10]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [12]:
# Get the unique values of the type of city
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [14]:
# Number of urban cities
sum(city_data_df["type"]=="Urban")

66

In [15]:
# Number of suburban cities
sum(city_data_df["type"]=="Suburban")

36

In [16]:
# Number of rural cities
sum(city_data_df["type"]=="Rural")

18

In [17]:
# inspect ride data 
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [19]:
ride_data_df["city"].unique()

array(['Lake Jonathanshire', 'South Michelleport', 'Port Samanthamouth',
       'Rodneyfort', 'South Jack', 'South Latoya', 'New Paulville',
       'Simpsonburgh', 'South Karenland', 'North Jasmine',
       'New Kimberlyborough', 'West Angela', 'Roberthaven', 'North Jason',
       'Williamsview', 'Leahton', 'West Anthony', 'New Paulton',
       'West Patrickchester', 'Deanville', 'West Josephberg',
       'West Samuelburgh', 'West Heidi', 'Loganberg', 'Huntermouth',
       'Grahamburgh', 'Port Frank', 'East Kaylahaven', 'West Robert',
       'North Markport', 'Richardfort', 'Reynoldsfurt', 'Justinberg',
       'Martinezhaven', 'Jerryton', 'Lake Scottton', 'South Evanton',
       'Rogerston', 'West Ericstad', 'Hurleymouth', 'Joneschester',
       'Port Angela', 'Barajasview', 'West Christopherberg',
       'New Jacobville', 'Port David', 'Valentineton', 'Carriemouth',
       'Williamsstad', 'Royland', 'Karenberg', 'Christopherfurt',
       'Liumouth', 'Johnton', 'Erikaland', 'Raymondhaven', 'Karenside',
       'Lake Danielberg', 'South Phillip', 'North Madeline',
       'Port Johnbury', 'Robertport', 'Pattyland', 'Amandaburgh',
       'North Barbara', 'West Gabriel', 'Barronchester', 'East Kentstad',
       'Lake Omar', 'Myersshire', 'West Hannah', 'East Marymouth',
       'New Raymond', 'Lake Robertside', 'Josephside', 'Brandonfort',
       'Lewisland', 'North Richardhaven', 'New Olivia', 'New Shannonberg',
       'Nicolechester', 'Victoriaport', 'South Teresa', 'East Aaronbury',
       'Bethanyland', 'Lake Scott', 'North Jeffrey', 'Rodriguezview',
       'Sotoville', 'South Brenda', 'Port Shane', 'North Timothy',
       'Veronicaberg', 'Williamsonville', 'Lewishaven', 'Lake Ann',
       'Grayville', 'Colemanland', 'West Kimmouth', 'Mezachester',
       'Davidfurt', 'East Danielview', 'Randallchester', 'North Holly',
       'Michaelberg', 'Lake Latoyabury', 'Taylorhaven', 'Garzaport',
       'New Ryantown', 'Bradshawfurt', 'South Marychester', 'Jessicaport',
       'South Jennifer', 'South Saramouth', 'Lake Jamie', 'Newtonview',
       'North Jaime', 'Penaborough', 'Harringtonfort', 'West Heather'],
      dtype=object)

In [20]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [21]:
# Get the columns and the rows that are not null.
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [22]:
# Get the columns and the rows that are null.
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [23]:
# Get the data types of each column.
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [27]:
# Merge the two data sets
ride_city_data_df = pd.merge(ride_data_df, city_data_df,how = "left", on=["city", "city"])
ride_city_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban